#Область ПрограммныйИнтерфейс

// Процедура предназначена для заполнения документов.
// Применяются следующие принципы:
// - все что заполнено обработчиками в модуле объекта считается первичным и наиболее приоритетным.
// - остальное заполнение выполняется по цепочке, через структуру ДанныеЗаполнения.
// - каждая последующая процедура в цепочке дополняет структуру ДанныеЗаполнения,
// при этом, если указанный реквизит уже заполнен в ДокументОбъект, то в структуру
// ДанныеЗаполнения он не попадет.
// - по окончании выполнения цепочки ДокументОбъект заполняеится данными из ДанныеЗаполнения.
//
// Параметры:
//	ДокументОбъект			- ДокументОбъект - заполняемый документ.
//	ДанныеЗаполнения		- Структура, ЛюбаяСсылка - значение, на основании
//							которого выполняется заполнение документа.
//	СтратегияЗаполнения 	- Строка - имя процедуры обработчика заполнения
//							в модуле объекта.
//							- Соответствие - соответствие типов параметра
//							ДанныеЗаполнения и имен обработчиков заполнения
//							в модуле объекта.
//	ИсключаяСвойства		- Строка - список имен свойств, разделенный запятыми,
//							которые необходимо исключить из заполнения.
//@skip-check doc-comment-collection-item-type
Процедура ЗаполнитьДокумент(ДокументОбъект, Знач ДанныеЗаполнения, Знач СтратегияЗаполнения = Неопределено, ИсключаяСвойства = "") Экспорт

	Если ПропуститьЗаполнение(ДанныеЗаполнения) Тогда
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения);
		Возврат;
	КонецЕсли;
	
	ПреобразоватьДанныеЗаполненияСсылочногоТипаВСтруктуру(ДанныеЗаполнения, ДокументОбъект);
	
	ДанныеЗаполнения.Вставить("Автор", Пользователи.ТекущийПользователь());
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения, , ИсключаяСвойства);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает признак того необходимо ли пропускать заполнение данного объекта.
//
// Параметры:
//	ДанныеЗаполнения		- Структура, ЛюбаяСсылка - значение, на основании
//							которого выполняется заполнение документа.
// Возвращаемое значение:
//	Булево - Признак того что нужно или не нужно пропустить заполнение объекта
//
Функция ПропуститьЗаполнение(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.Свойство("ПропуститьЗаполнение") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения.ПропуститьЗаполнение) = Тип("Булево") Тогда
		Возврат ДанныеЗаполнения.ПропуститьЗаполнение;
	КонецЕсли;
	
КонецФункции

// В случае когда в ДанныеЗаполнения передано значение ссылочного типа,
// преобразует ДанныеЗаполнения в Структуру.
// Если заполняемый документ еще не содержит значения, переданного
// в параметре ДанныеЗаполнения, указанное значение будет помещено
// в структуру ДанныеЗаполнения.
//
// Паарметры:
//	ДаннныеЗаполнения		- Произвольный - значение, на основании которого
//							выполняется заполнение документа.
//	ДокументОбъект 			- ДокументОбъект - заполняемый документ.
//
//@skip-check doc-comment-parameter-in-description-suggestion
Процедура ПреобразоватьДанныеЗаполненияСсылочногоТипаВСтруктуру(ДанныеЗаполнения, ДокументОбъект)
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ДанныеЗаполнения = Новый Структура;
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти